'''
1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,
а должна запрашивать новые данные для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), то программа
должна сообщать ему об ошибке и снова запрашивать знак операции. Также сообщать пользователю о невозможности
деления на ноль, если он ввел 0 в качестве делителя.
'''

n1 = int(input('Введите число 1: '))
n2 = int(input('Введите число 2: '))
znak = ''
while znak != '0':
    znak = input('Введите знак арифметической операции между числом 1 и числом 2 (0 для выхода): ')
    if znak == '0' or znak == '+' or znak == '-' or znak == '/' or znak == '*':
        if znak == '0':
            print('Программа завершена пользователем')
            pass
        elif znak == '/':
            if n2 == 0:
                print('Попытка деления на 0')
                while n2 == 0:
                    n2 = int(input('Введите число 2: '))
            else:
                print(f'{n1} / {n2} = {n1 / n2}')
        elif znak == '+':
            print(f'{n1} + {n2} = {n1 + n2}')
        elif znak == '-':
            print(f'{n1} - {n2} = {n1 - n2}')
        else:
            print(f'{n1} * {n2} = {n1 * n2}')
    else:
        print('Неверное значение')


