'''
7. Написать программу, доказывающую или проверяющую, что для множества натуральных чисел
выполняется равенство: 1+2+...+n = n(n+1)/2, где n – любое натуральное число.
'''

n = int(input('Введите число: '))
summ = 0
error = 0
for i in range(1, n + 1):
    summ += i
    if summ != i * (i + 1) / 2:
        print(f'{i}\tНЕверно')
        error += 1

print('Равенство выполняется не всегда!') if error > 0 else print('Равенство выполняется всегда!')


