'''
В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток.
После каждой неудачной попытки должно сообщаться, больше или
меньше загаданного введенное пользователем число.
Если за 10 попыток число не отгадано, то вывести его.
'''

import random

n = random.randint(0,100)
print('Загадано число о 0 до 100! Попробуй угадать, какое это число. У тебя 10 попыток!')
for i in range(10):
    d = int(input('Введите число: '))
    if d == n:
        print(f'\nЭТОГО НЕ МОЖЕТ БЫТЬ! ВЫ УГАДАЛИ!!! Это число действительно {n}!!!!')
        print('Похоже, Вам стоило выбрать путь биржевого аналитика, а не программиста!')
        quit()
    else:
        print(f'Не в этот раз! Но у тебя осталось еще {10-1-i} попыток!')
        if n < d:
            print(f'Подсказка: загаданное число меньше {d}')
        else:
            print(f'Подсказка: загаданное число больше {d}')
print('\nЭТО ПРОВАЛ!!!')
print(f'Как можно было не угадать число {n}???')




